Revit 2027 API
ColorFillScheme.UpdateEntry Method
 Updates the scheme entry with the same parameter value as the input entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateEntry(
	ColorFillSchemeEntry entry
)
Public Sub UpdateEntry (
	entry As ColorFillSchemeEntry
)
public:
void UpdateEntry(
	ColorFillSchemeEntry^ entry
)
member UpdateEntry :
        entry : ColorFillSchemeEntry -> unit
Parameters
entry ColorFillSchemeEntry
 The entry to be updated.
Exceptions
Exception | Condition
ArgumentException |  The entry does not exist or the same as input one. -or- The entry does not exist or all the updating fields are the same as existing one.
ArgumentNullException |  A non-optional argument was null
Remarks
The following entry fields can be updated:
Color
FillPattenId
Caption
IsVisible
/
See Also
Reference
ColorFillScheme Class
Autodesk.Revit.DB Namespace